import math

print('Простые арифметические операции', 3 * 7, (17 - 2) * 8)
print('Возведение в степень с оператором **', 2 ** 16)
print('Возведение через pow (возвращает float)', math.pow(2, 16))
print('Деление и получение дроби ', 37 / 3)
print('Частное от деления нацело', 37 // 3)
print('Остаток от деления нацело ', 37 % 3)

print('Деление дроби ', 37.4 / 3)
print('Деление дроби и математическое округление результата ', round(37 / 3))
print('Деление дроби и округление результата вниз (в сторону меньшего целого) ', math.floor(37.4 / 3))
print('Деление дроби и округление результата вверх (в сторону большего целого) ', math.ceil(37 / 3))



